{
  "news": [
    {
      "id": "0001",
      "img": "https://media.nurengroup.com/lib/images/nurengroup_BMFM.jpeg",
      "title": "Parenting Platform Nuren Group's 10 Year Journey, SuperApp & IPO Plans",
      "date": "08/11/2023",
      "description": "Roshan Kanesan speaks with Nuren Group’s CEO Petrina Goh and Creative Director Maton Shukor, to learn the story behind the company’s birth and 10 year journey, the rationale and business value of building a superapp, and what’s next for this company. 10 years in, Nuren has over 5 million users, 15 million monthly views, and launched their Parenting SuperApp by Motherhood earlier this year. All this has helped generate RM50 million revenue in the last 3 years.",
      "interview": [
        {
          "label": "BFM 89.9",
          "link": "https://www.bfm.my/podcast/enterprise/open-for-business/parenting-platform-nuren-groups-10-year-journey-superapp-and-nasdaq-ipo-plans"
        }
      ]
    },
    {
      "id": "0002",
      "img": "https://media.nurengroup.com/lib/images/nurengroup_mca2023.jpeg",
      "title": "Nuren Group Unveils Winners At Motherhood Choice Awards 2023",
      "date": "20/09/2023",
      "description": "7,000 Malaysian Moms Speak, 100 Parenting Brands Shine. Motherhood.com.my celebrated a roster of over 100 exceptional brands at the Motherhood Choice Awards 2023. With more than 130,000 votes from participating voters, Motherhood Choice Awards 2023 proudly announce 100 brands that made important contributions to the world of motherhood and parenting, offering valuable products and services that cater to the unique needs and challenges of raising children.",
      "article": [
        {
          "label": "Junipers Journal",
          "link": "https://www.junipersjournal.com/7000-malaysian-moms-speak100-parenting-brands-shine-nuren-group-unveils-winners-at-motherhood-choice-awards-2023/"
        },
        {
          "label": "Sinar Daily",
          "link": "https://www.sinardaily.my/article/209955/lifestyle/life/nuren-group-unveils-winners-at-motherhood-choice-awards-2023"
        }
      ]
    }
  ]
}
